const Line = require('../models/line');

const lines = [];

const defaultLines = [
  {
    name: 'الخط الأول',
    stops: [
      'حلوان',
      'عين حلوان',
      'جامعة حلوان',
      'وادي حوف',
      'حدائق حلوان',
      'المعصرة',
      'طرة الاسمنت',
      'كوستيكا',
      'طرة البلد',
      'ثكنات المعادي',
      'المعادي',
      'حدائق المعادي',
      'دار السلام',
      'الزهراء',
      'مار جرجس',
      'الملك الصالح',
      'السيدة زينب',
      'سعد زغلول',
      'السادات',
      'جمال عبد الناصر',
      'عرابي',
      'الشهداء',
      'غمرة',
      'الدمرداش',
      'منشية الصدر',
      'كوبري القبة',
      'حمامات القبة',
      'سراي القبة',
      'حدائق الزيتون',
      'حلمية الزيتون',
      'المطرية',
      'عين شمس',
      'عزبة النخيل',
      'المرج',
      'المرج الجديدة',
    ],
  },

  {
    name: 'الخط الثاني',
    stops: [
      'المنيب',
      'ساقية مكي',
      'أم المصريين',
      'الجيزة',
      'فيصل',
      'جامعة القاهرة',
      'البحوث',
      'الدقي',
      'الأوبرا',
      'السادات',
      'محمد نجيب',
      'العتبة',
      'الشهداء',
      'مسرة',
      'روض الفرج',
      'سانت تريزا',
      'الخلفاوي',
      'المظلات',
      'كلية الزراعة',
      'شبرا الخيمة',
    ],
  },

  {
    name: 'الخط الثالث',
    stops: [
      'العتبة',
      'باب الشعرية',
      'الجيش',
      'عبده باشا',
      'العباسية',
      'ارض المعارض',
      'الاستاد',
      'كلية البنات',
      'الاهرام',
    ],
  },
];

const add = (name, stops) => {
  lines.push(new Line(name, stops));
};

module.exports = { lines: defaultLines, addLines: add };
